In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [2]:
df=pd.read_csv('E:\\0_PYTHON\\9_Datasets\\PJM\\AEP_hourly.csv' ,parse_dates=True)
df.head(1)

              Datetime   AEP_MW
0  2004-12-31 01:00:00  13478.0

In [3]:
# Drop Duplicates Except the First Occurrence
df.drop_duplicates(subset=['Datetime'], keep ='first',  inplace= True)
print('len = ',len(df))

len =  121269

In [4]:
df['Datetime']=pd.to_datetime(df['Datetime'])
df.set_index('Datetime', inplace=True)
df.head(1)

                      AEP_MW
Datetime
2004-12-31 01:00:00  13478.0

In [5]:
df=df.sort_index(ascending=True)

In [6]:
print(df.head(1))
print(df.tail(1))

                      AEP_MW
Datetime
2004-10-01 01:00:00  12379.0
             AEP_MW
Datetime
2018-08-03  14809.0

In [7]:
missing_Timestamp=pd.date_range('2004-10-01','2018-08-03',freq='H').difference(df.index)
print('\nNumber of Missing Timestamp= ',len(missing_Timestamp),'\n')
print(missing_Timestamp.to_list())

Number of Missing Timestamp=  28

[Timestamp('2004-10-01 00:00:00'), Timestamp('2004-10-31 02:00:00'), Timestamp('2005-04-03 03:00:00'), Timestamp('2005-10-30 02:00:00'), Timestamp('2006-04-02 03:00:00'), Timestamp('2006-10-29 02:00:00'), Timestamp('2007-03-11 03:00:00'), Timestamp('2007-11-04 02:00:00'), Timestamp('2008-03-09 03:00:00'), Timestamp('2008-11-02 02:00:00'), Timestamp('2009-03-08 03:00:00'), Timestamp('2009-11-01 02:00:00'), Timestamp('2010-03-14 03:00:00'), Timestamp('2010-11-07 02:00:00'), Timestamp('2010-12-10 00:00:00'), Timestamp('2011-03-13 03:00:00'), Timestamp('2011-11-06 02:00:00'), Timestamp('2012-03-11 03:00:00'), Timestamp('2012-11-04 02:00:00'), Timestamp('2012-12-06 04:00:00'), Timestamp('2013-03-10 03:00:00'), Timestamp('2013-11-03 02:00:00'), Timestamp('2014-03-09 03:00:00'), Timestamp('2014-03-11 14:00:00'), Timestamp('2015-03-08 03:00:00'), Timestamp('2016-03-13 03:00:00'), Timestamp('2017-03-12 03:00:00'), Timestamp('2018-03-11 03:00:00')]

In [8]:
df = df.resample('H').first().fillna(np.NaN)
missing_Timestamp=pd.date_range('2004-10-01','2018-08-03',freq='H').difference(df.index)
print('\nNumber of Missing Timestamp= ',len(missing_Timestamp),'\n')
print(missing_Timestamp.to_list())

Number of Missing Timestamp=  1

[Timestamp('2004-10-01 00:00:00')]

In [9]:
df.reset_index(inplace=True)
len_list=df[df['AEP_MW'].isnull()].index.tolist()
df.iloc[len_list[:len(len_list)]]

                  Datetime  AEP_MW
721    2004-10-31 02:00:00     NaN
4418   2005-04-03 03:00:00     NaN
9457   2005-10-30 02:00:00     NaN
13154  2006-04-02 03:00:00     NaN
18193  2006-10-29 02:00:00     NaN
21386  2007-03-11 03:00:00     NaN
27097  2007-11-04 02:00:00     NaN
30122  2008-03-09 03:00:00     NaN
35833  2008-11-02 02:00:00     NaN
38858  2009-03-08 03:00:00     NaN
44569  2009-11-01 02:00:00     NaN
47762  2010-03-14 03:00:00     NaN
53473  2010-11-07 02:00:00     NaN
54263  2010-12-10 00:00:00     NaN
56498  2011-03-13 03:00:00     NaN
62209  2011-11-06 02:00:00     NaN
65234  2012-03-11 03:00:00     NaN
70945  2012-11-04 02:00:00     NaN
71715  2012-12-06 04:00:00     NaN
73970  2013-03-10 03:00:00     NaN
79681  2013-11-03 02:00:00     NaN
82706  2014-03-09 03:00:00     NaN
82765  2014-03-11 14:00:00     NaN
91442  2015-03-08 03:00:00     NaN
100346 2016-03-13 03:00:00     NaN
109082 2017-03-12 03:00:00     NaN
117818 2018-03-11 03:00:00     NaN

In [10]:
print('values are missing at the following indexes:\n',len_list)

values are missing at the following indexes:
 [721, 4418, 9457, 13154, 18193, 21386, 27097, 30122, 35833, 38858, 44569, 47762, 53473, 54263, 56498, 62209, 65234, 70945, 71715, 73970, 79681, 82706, 82765, 91442, 100346, 109082, 117818]

In [11]:
df.isnull().sum()

Datetime     0
AEP_MW      27
dtype: int64

In [12]:
df['AEP_MW'] = df['AEP_MW'].interpolate()

In [13]:
df.isnull().sum()

Datetime    0
AEP_MW      0
dtype: int64

# Holidays

In [14]:
df['Date'] = df['Datetime'].dt.normalize()
df.head(2)

             Datetime   AEP_MW       Date
0 2004-10-01 01:00:00  12379.0 2004-10-01
1 2004-10-01 02:00:00  11935.0 2004-10-01

In [15]:
holiday=pd.read_csv('E:\\0_PYTHON\\9_Datasets\\PJM\\processed_holiday.csv',parse_dates=['Date'])
holiday.head()

        Date                      Holiday   WeekDay  Month  Day  Year
0 2004-01-01               New Year's Day  Thursday      1    1  2004
1 2004-01-19  Martin Luther King, Jr. Day    Monday      1   19  2004
2 2004-02-14              Valentine’s Day  Saturday      2   14  2004
3 2004-02-16        Washington's Birthday    Monday      2   16  2004
4 2004-04-11               Eastern Easter    Sunday      4   11  2004

In [16]:
holiday.drop(['WeekDay','Month','Day','Year'],axis=1, inplace=True)
df.head()

             Datetime   AEP_MW       Date
0 2004-10-01 01:00:00  12379.0 2004-10-01
1 2004-10-01 02:00:00  11935.0 2004-10-01
2 2004-10-01 03:00:00  11692.0 2004-10-01
3 2004-10-01 04:00:00  11597.0 2004-10-01
4 2004-10-01 05:00:00  11681.0 2004-10-01

In [17]:
mergedf = pd.merge(df, holiday, on= 'Date', how="left")
mergedf

                  Datetime   AEP_MW       Date Holiday
0      2004-10-01 01:00:00  12379.0 2004-10-01     NaN
1      2004-10-01 02:00:00  11935.0 2004-10-01     NaN
2      2004-10-01 03:00:00  11692.0 2004-10-01     NaN
3      2004-10-01 04:00:00  11597.0 2004-10-01     NaN
4      2004-10-01 05:00:00  11681.0 2004-10-01     NaN
...                    ...      ...        ...     ...
121291 2018-08-02 20:00:00  17673.0 2018-08-02     NaN
121292 2018-08-02 21:00:00  17303.0 2018-08-02     NaN
121293 2018-08-02 22:00:00  17001.0 2018-08-02     NaN
121294 2018-08-02 23:00:00  15964.0 2018-08-02     NaN
121295 2018-08-03 00:00:00  14809.0 2018-08-03     NaN

[121296 rows x 4 columns]

In [18]:
mergedf['Holiday'] = mergedf['Holiday'].notnull().astype("int")
mergedf.head()

             Datetime   AEP_MW       Date  Holiday
0 2004-10-01 01:00:00  12379.0 2004-10-01        0
1 2004-10-01 02:00:00  11935.0 2004-10-01        0
2 2004-10-01 03:00:00  11692.0 2004-10-01        0
3 2004-10-01 04:00:00  11597.0 2004-10-01        0
4 2004-10-01 05:00:00  11681.0 2004-10-01        0

In [19]:
mergedf.drop(['Date'],axis=1,inplace=True)
mergedf.head(1)

             Datetime   AEP_MW  Holiday
0 2004-10-01 01:00:00  12379.0        0

In [20]:
mergedf.to_csv('E:\\0_PYTHON\\9_Datasets\\PJM\\AEP_hourly_processd.csv',index=False)